{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"sequential_1_input": {"name": "sequential_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"dense_3": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "18"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "13"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "18"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "18"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "18"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "18"}, {"size": "10000"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/mul", "op": "Mul", "input": ["sequential_1_input", "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2/rescaling_2/mul", "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2/rescaling_2/add", "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd", "StatefulPartitionedCall/sequential_2/conv2d_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2/conv2d_3/mul_1", "StatefulPartitionedCall/sequential_2/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/flatten_1/Reshape", "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/mul", "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/dense_2/mul_1", "StatefulPartitionedCall/sequential_2/dense_2/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/mul", "shape": [18], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp", "shape": [13, 13, 3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp", "shape": [4096, 18], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp", "shape": [18], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/batch_normalization/batchnorm/sub", "shape": [18], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp", "shape": [18, 10000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp", "shape": [10000], "dtype": "float32"}]}]}